Repository: amyhuang13506-svg/LangPod
Catalog: LangPod/Localizable.xcstrings
Source language: zh_hans
Languages: en, es, ja, ko, pt_br, zh_hant

source: 校园、社交、日常琐事，留学场景课优先安排
en: Campus, Social, Daily Tasks - Priority Study Abroad Lessons
es: Campus, social, tareas diarias, clases de estudio prioritarias
ja: キャンパス、社交、日常、留学シーンの講座優先
ko: 캠퍼스·사회적·일상 소소한 것, 유학 상황 수업 우선
pt_br: Campus, social, cotidiano, aulas de intercâmbio em prioridade
zh_hant: 校園、社交、日常瑣事，留學場景課優先安排

source: 模拟现场对话
en: Simulate Live Conversation
es: Simular diálogo
ja: 会話シミュレーション
ko: 현장 대화 연습
pt_br: Simular conversa
zh_hant: 模擬現場對話

source: 正在准备场景…
en: Preparing Scene…
es: Preparando escena...
ja: シーンを準備中…
ko: 상황 준비 중…
pt_br: Preparando cena...
zh_hant: 正在準備場景…

source: 正在播放
en: Playing
es: Reproduciendo
ja: 再生中
ko: 재생 중
pt_br: Tocando agora

source: 正在生成你的专属计划…
en: Creating Your Custom Plan…
es: Creando tu plan personalizado...
ja: 専用プランを生成中…
ko: 맞춤 계획 생성 중…
pt_br: Gerando seu plano exclusivo…
zh_hant: 正在生成你的專屬計畫…

source: 正确答案：%@
en: Correct Answer: %@
es: Respuesta correcta: %@
ja: 正しい答え：%@
ko: 정답: %@
pt_br: Resposta correta: %@
zh_hant: 正確答案：%@

source: 正确！
en: Correct!
es: ¡Correcto!
ja: 正解！
ko: 정답!
pt_br: Correto!
zh_hant: 正確！

source: 母语级
en: Native-Level
es: Nivel nativo
ja: ネイティブレベル
ko: 모국어 수준
pt_br: Nível nativo
zh_hant: 母語級

source: 每天 %lld 分钟
en: %lld Minutes a Day
es: %lld minutos al día
ja: 毎日 %lld 分
ko: 매일 %lld분
pt_br: Todos os dias por %lld minutos
zh_hant: 每天 %lld 分鐘

source: 每天 1 集%@播客
en: 1 Episode of %@ Podcast Daily
es: 1 episodio diario de %@ pódcast
ja: 毎日1話%@ポッドキャスト
ko: 매일 1편 %@ 팟캐스트
pt_br: 1 episódio de %@ podcast por dia
zh_hant: 每天 1 集%@Podcast

source: 每天 10 分钟
en: 10 Minutes a Day
es: 10 minutos diarios
ja: 毎日10分
ko: 하루 10분
pt_br: 10 minutos por dia
zh_hant: 每天 10 分鐘

source: 每天 15 分钟
en: 15 Minutes a Day
es: 15 minutos diarios
ja: 毎日15分
ko: 하루 15분
pt_br: 15 minutos por dia
zh_hant: 每天 15 分鐘

source: 每天 20 分钟
en: 20 Minutes a Day
es: 20 minutos diarios
ja: 毎日20分
ko: 하루 20분
pt_br: 20 minutos por dia
zh_hant: 每天 20 分鐘

source: 每天 30 分钟
en: 30 Minutes a Day
es: 30 minutos diarios
ja: 毎日30分
ko: 하루 30분
pt_br: 30 minutos por dia
zh_hant: 每天 30 分鐘

source: 每天 5 分钟
en: 5 Minutes a Day
es: 5 minutos diarios
ja: 毎日5分
ko: 하루 5분
pt_br: 5 minutos por dia
zh_hant: 每天 5 分鐘

source: 每天 6 分钟，随时随地
en: 6 Minutes a Day, Anytime, Anywhere
es: 6 min al día, en cualquier momento
ja: 毎日6分、いつでもどこでも
ko: 하루 6분, 언제 어디서나
pt_br: 6 minutos por dia, a qualquer hora e lugar
zh_hant: 每天 6 分鐘，隨時隨地

source: 每天任务打卡，滴水穿石！
en: Daily Check-In, Consistent Effort!
es: Check-in diario, ¡la constancia rinde!
ja: 毎日のタスクチェックインでコツコツ！
ko: 매일 체크인, 꾸준히 노력하세요!
pt_br: Check-in diário, conquiste desafios!
zh_hant: 每天任務打卡，滴水穿石！

source: 每天做什么
en: Daily Routine
es: Qué hacer cada día
ja: 毎日何をする
ko: 매일 무엇을 할까
pt_br: O que fazer diariamente
zh_hant: 每天做什麼

source: 每天想投入多久？
en: How Much Time Daily?
es: ¿Cuánto tiempo diario?
ja: 毎日どのくらい時間をかけますか？
ko: 매일 얼마나 투자하고 싶으세요?
pt_br: Quanto tempo quer dedicar por dia?

source: 每天最多一条，可随时在设置里关闭
en: Up to One a Day, Disable Anytime in Settings
es: Máx. uno al día, desactiva en ajustes
ja: 1日1件まで。設定でいつでもオフ
ko: 하루 최대 한 개, 설정에서 언제든지 끌 수 있어요
pt_br: Máximo de uma por dia, pode desativar nas configurações
zh_hant: 每天最多一條，可隨時在設定裡關閉

source: 每日任务打卡
en: Daily Task Check-In
es: Check-in de tareas diarias
ja: 毎日のタスクチェックイン
ko: 매일 임무 체크인
pt_br: Check-in de tarefas diárias
zh_hant: 每日任務打卡

source: 每日学习
en: Daily Study
es: Aprendizaje diario
ja: 毎日学習
ko: 매일 공부
pt_br: Estudo diário
zh_hant: 每日學習

source: 每日提醒
en: Daily Reminder
es: Recordatorio diario
ja: 毎日のリマインダー
ko: 일일 알림
pt_br: Lembrete diário

source: 每日新播客
en: Daily New Podcast
es: Nuevo pódcast diario
ja: 毎日新しいポッドキャスト
ko: 매일 신규 팟캐스트
pt_br: Novo podcast diário
zh_hant: 每日新Podcast

source: 没有匹配的内容
en: No Matching Content
es: No hay coincidencias
ja: 一致するコンテンツがありません
ko: 일치하는 내용 없음
pt_br: Sem resultados
zh_hant: 沒有匹配的內容

source: 没有找到相关内容
en: No Relevant Content Found
es: No se encontró contenido relacionado
ja: 関連コンテンツが見つかりません
ko: 관련 내용 없음
pt_br: Nenhum conteúdo encontrado
zh_hant: 沒有找到相關內容

source: 流利听众
en: Fluent Listener
es: Oyente fluido
ja: 上級リスナー
ko: 유창한 청취자
pt_br: Ouvinte fluente
zh_hant: 流利聽眾

source: 清除
en: Clear
es: Borrar
ja: 削除
ko: 삭제
pt_br: Limpar

source: 清除已掌握词汇
en: Clear Mastered Words
es: Borrar palabras dominadas
ja: マスター済み単語を削除
ko: 마스터한 단어 삭제
pt_br: Limpar palavras dominadas
zh_hant: 清除已掌握單字

source: 清除所有数据
en: Clear All Data
es: Borrar todos los datos
ja: すべてのデータを削除
ko: 모든 데이터 삭제
pt_br: Limpar todos os dados
zh_hant: 清除所有資料

source: 清零
en: Reset
es: Vaciar
ja: リセット
ko: 초기화
pt_br: Zerar

source: 源自 · %@
en: From · %@
es: De · %@
ja: 出典 · %@
ko: 출처 · %@
pt_br: Fonte · %@

source: 澳洲
en: Australia
es: Australia
ja: オーストラリア
ko: 호주
pt_br: Austrália

source: 炫耀一下
en: Show Off
es: Presumir
ja: シェアする
ko: 자랑하기
pt_br: Mostrar

source: 点击下方单词组成句子
en: Tap the Words Below to Form a Sentence
es: Haz clic en las palabras de abajo para formar la frase
ja: 単語をクリックして文を作る
ko: 아래 단어를 클릭하여 문장을 만드세요
pt_br: Clique nas palavras abaixo para formar a frase
zh_hant: 點擊下方單字組成句子

source: 点击左边英文，再点右边中文释义进行配对
en: Tap Left English, Then Right Translation to Match
es: Toca la izquierda en inglés, luego la derecha en traducción al español para emparejar
ja: 左の英語をクリックして、日本語訳とマッチング
ko: 왼쪽 영어 클릭, 오른쪽 한국어 번역 클릭해 매칭
pt_br: Toque na palavra inglesa à esquerda e, depois, na tradução em português à direita para combinar
zh_hant: 點擊左邊英文，再點右邊中文釋義進行配對

source: 点单、租房、看病、机场，学了就能用 每天几分钟，听得懂，开得了口
en: Ordering, Renting, Doctor Visits, Airports A Few Minutes Daily, You'll Understand and Speak
es: Pedir, alquilar, doctor, aeropuerto. Aprende y úsalo Cinco minutos al día. Escucha y habla
ja: 注文、部屋探し、診察、空港、学べばすぐ使える 毎日数分、聞いて話せる
ko: 주문, 집 임대, 병원, 공항 등 매일 몇 분씩, 들을 수 있고 말할 수 있어요
pt_br: Pedido, aluguel, consulta, aeroporto — aprenda e use Com poucos minutos diários, você entende e fala
zh_hant: 點餐、租屋、看病、機場，學了就能用 每天幾分鐘，聽得懂，開得了口

source: 点单、租房、看病，按真实场景分类的实用课
en: Order, Rent, Medical - Practical Scene-Based Lessons
es: Pedir, alquilar, médico, clases prácticas por escenarios reales
ja: 注文、賃貸、病院、リアルシーン別の実用講座
ko: 주문·집 임대·진료, 실제 상황 분류 실용 수업
pt_br: Pedidos, aluguel, consultas, aulas práticas por cenários reais
zh_hant: 點單、租房、看病，按真實場景分類的實用課

source: 点开学一个地道句型
en: Tap to Learn a Natural Pattern
es: Toca para aprender un patrón fluido
ja: クリックして自然な文型を学ぼう
ko: 눌러서 자연스러운 문형 배우기
pt_br: Clique para aprender um padrão natural
zh_hant: 點開學一個地道句型

source: 生活、文化、旅行话题
en: Life, Culture, Travel Topics
es: Vida, cultura, viajes
ja: 生活・文化・旅行の話題
ko: 생활, 문화, 여행
pt_br: Temas de vida, cultura e viagem
zh_hant: 生活、文化、旅行話題

source: 生活场景
en: Everyday Scenes
es: Escena cotidiana
ja: 生活シーン
ko: 생활 상황
pt_br: Cenas do cotidiano
zh_hant: 生活場景

source: 生词无限保存 · 无限练习
en: Unlimited Word Save · Unlimited Practice
es: Guardar vocabulario ilimitado · Práctica ilimitada
ja: 新しい単語無限保存 · 無限練習
ko: 단어 무제한 저장 · 무제한 연습
pt_br: Novas palavras ilimitadas · Prática ilimitada
zh_hant: 生字無限保存 · 無限練習

source: 用户协议
en: User Agreement
es: Acuerdo de usuario
ja: 利用規約
ko: 이용 약관
pt_br: Acordo de usuário
zh_hant: 用戶協議

source: 用时
en: Time Used
es: Duración
ja: 使用時間
ko: 소요 시간
pt_br: Duração
zh_hant: 用時

source: 用这个词组成正确的句子：
en: Make a Correct Sentence Using This Word:
es: Forma una frase correcta con esta palabra:
ja: この単語を使って正しい文を作ってください：
ko: 이 단어로 올바른 문장을 만드세요:
pt_br: Forme uma frase correta com esta palavra:
zh_hant: 用這個詞組成正確的句子：

source: 留学生活
en: Study Abroad Life
es: Vida de estudiante
ko: 유학 생활
pt_br: Vida de intercâmbio
zh_hant: 留學生活

source: 看视频
en: Watch Video
es: Ver video
ja: ビデオを見る
ko: 영상 보기
pt_br: Assistir vídeo
zh_hant: 看影片

source: 真的用得上
en: Truly Useful
es: Realmente útil
ja: 本当に役立つ
ko: 정말 쓸모있음
pt_br: Realmente útil

source: 确认
en: Confirm
es: Confirmar
ja: 確認
ko: 확인
pt_br: Confirmar
zh_hant: 確認

source: 科技 · 评测
en: Tech · Reviews
es: Tecnología · Reseñas
ja: テクノロジー · レビュー
ko: 기술 · 리뷰
pt_br: Tecnologia · Avaliações
zh_hant: 科技 · 評測

source: 科普 · 科学
en: Science · Education
es: Divulgación · Ciencia
ja: 科学普及 · 科学
ko: 과학 상식 · 과학
pt_br: Popularização · Ciência
zh_hant: 科普 · 科學

source: 租房、看病、办事，海外生活场景课优先安排
en: Renting, Medical, Tasks - Priority Living Abroad Lessons
es: Alquilar, médico, trámites, clases de vida en el extranjero prioritarias
ja: 賃貸、病院、手続き、海外生活シーンの講座優先
ko: 집 임대·진료·일 처리, 해외 생활 상황 수업 우선
pt_br: Alugar, consultas, tarefas, aulas de vida no exterior em prioridade
zh_hant: 租房、看病、辦事，海外生活場景課優先安排

source: 立即订阅
en: Subscribe Now
es: Suscribirse ahora
ja: 今すぐ購読
ko: 지금 구독
pt_br: Assinar agora
zh_hant: 立即訂閱

source: 第 %lld 天
en: Day %lld
es: Día %lld
ja: 第 %lld 日
ko: %lld일차
pt_br: Dia %lld

source: 第 %lld 天 · 提醒你试用到期
en: Day %lld · Trial Ending Reminder
es: Día %lld · Recordatorio de vencimiento de prueba
ja: %lld日目 · 試用期限の通知
ko: %lld일차 · 체험 종료 알림
pt_br: Dia %lld · Aviso de expiração do teste
zh_hant: 第 %lld 天 · 提醒你試用到期

source: 第 %lld 天 · 满意续费，不满意取消
en: Day %lld · Renew if Satisfied, Cancel if Not
es: Día %lld · Renueva si satisfecho, cancela si no
ja: %lld日目 · 満足したら更新、満足しないならキャンセル
ko: %lld일차 · 만족시 갱신, 불만족시 취소
pt_br: Dia %lld · Renove se satisfeito, cancele se não
zh_hant: 第 %lld 天 · 滿意續費，不滿意取消

source: 第 %lld/%lld 轮
en: Round %lld/%lld
es: Ronda %lld/%lld
ja: %lld/%lld 回目
ko: %lld/%lld회차
pt_br: Rodada %lld/%lld
zh_hant: 第 %lld/%lld 輪

source: 第 %lld/%lld 遍
en: Round %lld/%lld
es: Ronda %lld/%lld
ja: 第 %lld/%lld 回
ko: %lld/%lld회차
pt_br: Rodada %lld/%lld

source: 第 %lld/%lld 遍 · 英语原音
en: Round %lld/%lld · English Audio
es: Ronda %lld/%lld · Inglés original
ja: 第 %lld/%lld 回 · 英語原音
ko: %lld/%lld회차 · 영어 원음
pt_br: Rodada %lld/%lld · Áudio original em inglês
zh_hant: 第 %lld/%lld 遍 · 英語原音

source: 第 1/%lld 遍
en: Round 1/%lld
es: Ronda 1/%lld
ja: 1/%lld回目
ko: 1/%lld회차
pt_br: Rodada 1/%lld

source: 第 4/%lld 遍
en: Round 4/%lld
es: Ronda 4/%lld
ja: 第 4/%lld 回
ko: 4/%lld회차
pt_br: Rodada 4/%lld

source: 第 4/%lld 遍 · 中文翻译
en: Round 4/%lld · Translation
es: Ronda 4/%lld · Traducción al español
ja: 第 4/%lld 回 · 日本語訳
ko: 4/%lld회차 · 한국어 번역
pt_br: Rodada 4/%lld · Tradução em português
zh_hant: 第 4/%lld 遍 · 中文翻譯

source: 第 4/4 遍 · 播放完成
en: Round 4/4 · Playback Complete
es: Ronda 4/4 · Reproducción completa
ja: 第 4/4 回 · 再生完了
ko: 4/4회차 · 재생 완료
pt_br: Rodada 4/4 · Reprodução concluída

source: 答对 %lld/%lld 题
en: Correct %lld/%lld
es: Correcto %lld/%lld preguntas
ja: %lld/%lld 問正解
ko: %lld/%lld 문제 정답
pt_br: Acertou %lld/%lld questões
zh_hant: 答對 %lld/%lld 題

source: 简单日常对话，慢速播放
en: Simple Daily Conversation, Slow Playback
es: Diálogos simples, reproducción lenta
ja: 簡単な日常会話、ゆっくり再生
ko: 일상 회화, 느린 재생
pt_br: Conversas diárias simples, em ritmo lento
zh_hant: 簡單日常對話，慢速播放

source: 累计
en: Total
es: Total
ja: 累計
ko: 누적
pt_br: Cumulativo
zh_hant: 累計

source: 累计活跃 %lld 天 · 90 天里程碑全部达成 🎉
en: Active for %lld Days · All 90-Day Milestones Achieved 🎉
es: Activo por %lld días · Logrados todos los hitos de 90 días 🎉
ja: 累計活動 %lld 日 · 90 日マイルストーン達成 🎉
ko: 누적 %lld일 활약 · 90일 이정표 모두 달성 🎉
pt_br: %lld dias ativos · Marco de 90 dias alcançado 🎉
zh_hant: 累計活躍 %lld 天 · 90 天里程碑全部達成 🎉

source: 累计活跃 %lld 天 · 还有 %lld 天到「%@」
en: %1$lld active days · %2$lld days to “%3$@”
es: Activo por %lld días · %lld días hasta「%@」
ja: 累計活動 %1$lld日 · 「%3$@」まであと %2$lld日
ko: 누적 활동 %1$lld일 · 「%3$@」까지 %2$lld일 남음
pt_br: Ativo por %lld dias · Faltam %lld dias para alcançar 「%@」
zh_hant: 累計活躍 %lld 天 · 還有 %lld 天到「%@」

source: 约 %lld 分钟
en: About %lld Minutes
es: Aprox. %lld minutos
ja: 約%lld分
ko: 약 %lld분
pt_br: Aprox. %lld minutos
zh_hant: 約 %lld 分鐘

source: 给我们评分
en: Rate Us
es: Califícanos
ja: 評価する
ko: 평가하기
pt_br: Avalie-nos
zh_hant: 給我們評分

source: 继续学习
en: Continue Learning
es: Continuar aprendiendo
ja: 学習を続ける
ko: 계속 학습
pt_br: Continuar aprendendo
zh_hant: 繼續學習

source: 美国
en: USA
es: Estados Unidos
ja: アメリカ
ko: 미국
pt_br: Estados Unidos
zh_hant: 美國

source: 翻译语言
en: Translation
es: Idioma de traducción
ja: 翻訳言語
ko: 번역 언어
pt_br: Idioma de tradução
zh_hant: 翻譯語言

source: 翻译语言跟随系统语言。可在系统设置中修改。
en: Translation follows system language. Change in system settings.
es: El idioma de traducción sigue al del sistema. Puedes cambiarlo en las configuraciones.
ja: 翻訳言語はシステム言語に従います。システム設定で変更できます。
ko: 번역 언어는 시스템 언어를 따릅니다. 시스템 설정에서 변경 가능합니다.
pt_br: Idioma de tradução segue o sistema. Pode ser alterado nas configurações.
zh_hant: 翻譯語言跟隨系統語言。可在系統設定中修改。

source: 耳朵热起来
en: Warm Up Ears
es: Activa tus oídos
ja: 耳を慣らす
ko: 귀가 익숙해지다
pt_br: Audio em alta
zh_hant: 耳朵熱起來

source: 职场沟通高频场景课优先安排
en: Priority Work Communication Lessons
es: Clases de comunicación laboral frecuentes prioritarias
ja: 職場コミュニケーションの頻出シーン講座優先
ko: 직장 소통 고빈도 상황 수업 우선
pt_br: Comunicação profissional, aulas de cenários frequentes em prioridade
zh_hant: 職場溝通高頻場景課優先安排

source: 职场高频表达张口就来，开会邮件不再卡壳
en: Effortless Work Phrases, No Hesitation in Meetings & Emails
es: Expresiones laborales frecuentes sin trabas en reuniones y correos
ja: 職場の頻出フレーズもすぐ出てくる、会議やメールで詰まらない
ko: 직장 고빈도 표현 자유롭게, 회의·이메일 끊김 없음
pt_br: Expressões do trabalho fluem, reuniões e e-mails sem bloqueios
zh_hant: 職場高頻表達張口就來，開會郵件不再卡殼

source: 能教
en: Can Teach
es: Enseñar
ja: 教えられる
ko: 가르칠 수 있음
pt_br: Ensinar

source: 英国
en: UK
es: Reino Unido
ja: イギリス
ko: 영국
pt_br: Reino Unido
zh_hant: 英國

source: 英语 ×3 → 中文 ×1 → 英语 ×1，重复成本能
en: Eng ×3 → Trans ×1 → Eng ×1, Repeat Ability
es: Inglés ×3 → Español ×1 → Inglés ×1, repetir hasta automático
ja: 英語×3 → 日本語訳×1 → 英語×1、繰り返しで反射的に
ko: 영어 ×3 → 한국어 ×1 → 영어 ×1, 반복 학습
pt_br: Inglês ×3 → Português ×1 → Inglês ×1, repetir até automático
zh_hant: 英語 ×3 → 中文 ×1 → 英語 ×1，重複成本能

source: 英语听力形成条件反射，把'学过'变成'用得上'
en: Turn Learning Into Reflexive Listening
es: Reacción de oído a inglés, convierte 'aprendido' en 'utilizable'
ja: 英語のヒアリングが条件反射に、'学んだ'を'使える'に変える
ko: 영어 듣기 반사 작용, 배운 것을 활용
pt_br: Audição de inglês vira reflexo, transformando o aprendido em útil
zh_hant: 英語聽力形成條件反射，把'學過'變成'用得上'

source: 表达库即将上线
en: Expression Library Coming Soon
es: Biblioteca de expresiones pronto
ja: 表現コレクションが近日公開
ko: 표현 라이브러리 곧 출시
pt_br: Biblioteca de expressões em breve
zh_hant: 表達庫即將上線

source: 视频源
en: Video Source
es: Fuente de video
ja: 動画ソース
ko: 비디오 소스
pt_br: Fonte de vídeo
zh_hant: 影片源

source: 解锁 Pro 查看全部 %lld 个生词
en: Unlock Pro to View All %lld Words
es: Desbloquea Pro para ver %lld palabras
ja: Proで全%lld語を表示
ko: Pro 해제하고 모든 %lld개 단어 보기
pt_br: Desbloqueie Pro para ver todas as %lld palavras
zh_hant: 解鎖 Pro 查看全部 %lld 個單字

source: 认出
en: Recognize
es: Reconocer
ja: 認識
ko: 인식함
pt_br: Identificar
zh_hant: 認出

source: 词义配对
en: Word Match
es: Emparejar palabras
ja: 単語マッチング
ko: 단어 매칭
pt_br: Combinar palavras
zh_hant: 單字配對

source: 词义配对一轮
en: Word Match Round
es: Una ronda de Emparejar palabras
ja: 単語マッチング1ラウンド
ko: 단어 매칭 1회
pt_br: Uma rodada de combinar palavras
zh_hant: 單字配對一輪

source: 词汇
en: Vocabulary
es: Vocabulario
ja: 語彙
ko: 어휘
pt_br: Vocabulário
zh_hant: 單字

source: 词汇 + 句型练习，连续打卡不断档
en: Vocab + Pattern Practice, Consistent Check-In
es: Vocabulario + práctica de patrones, check-in continuo
ja: 語彙 + 文型練習、連続チェックイン
ko: 어휘 + 문형 연습, 지속적 체크인
pt_br: Prática de palavras + padrões, check-in contínuo sem pausas
zh_hant: 單字 + 句型練習，連續打卡不斷檔

source: 词汇小课堂
en: Vocab Lesson
es: Mini clase de vocabulario
ja: 語彙レッスン
ko: 어휘 클래스
pt_br: Miniaula de vocabulário
zh_hant: 單字小課堂

source: 词汇新手
en: Vocab Rookie
es: Principiante de vocabulario
ja: 語彙初心者
ko: 어휘 초보
pt_br: Vocabulário iniciante
zh_hant: 單字新手

source: 词汇达人
en: Vocab Pro
es: Experto en vocabulario
ja: 語彙エキスパート
ko: 어휘 고수
pt_br: Vocabulário avançado
zh_hant: 單字達人

source: 该国家的课堂即将上线
en: Country-Specific Lesson Coming Soon
es: La clase de este país pronto disponible
ja: この国のレッスンが近日公開
ko: 해당 국가 클래스 곧 출시
pt_br: Aula deste país em breve
zh_hant: 該國家的課堂即將上線

source: 请检查网络后重试
en: Check Network and Try Again
es: Revisa la conexión y vuelve a intentarlo
ja: ネットワークを確認して再試行してください
ko: 네트워크 확인 후 다시 시도하세요
pt_br: Verifique sua conexão e tente novamente
zh_hant: 請檢查網路後重試

source: 读音
en: Pronunciation
es: Pronunciación
ja: 発音
ko: 발음
pt_br: Pronúncia
zh_hant: 讀音

source: 课堂内外的日常交流跟得上，社交场合敢开口
en: Keep Up With Daily & Social Conversations
es: Mantén el ritmo en intercambio diario, atrévete a hablar en eventos sociales
ja: 授業内外の会話に付いていける、社交の場で話せる
ko: 교실 안팎의 일상 대화, 사회적 상황에서 자신감
pt_br: Comunicação diária acompanha, se expressa em eventos sociais
zh_hant: 課堂內外的日常交流跟得上，社交場合敢開口

source: 购买失败：%@
en: Purchase Failed: %@
es: Error en la compra: %@
ja: 購入失敗：%@
ko: 구매 실패: %@
pt_br: Falha na compra: %@
zh_hant: 購買失敗：%@

source: 购买已完成，但未获得 Pro 权益，请稍后重试或联系客服。
en: Purchase complete, but Pro benefits not activated. Please try again later or contact support.
es: Compra completada, pero no se otorgaron beneficios Pro, intenta más tarde o contacta al servicio al cliente.
ja: 購入完了しましたが、Proの特典が得られませんでした。後ほど再試行するか、サポートに連絡してください。
ko: 구매 완료. 아직 Pro 혜택을 받지 못했어요. 잠시 후 다시 시도하거나 고객 센터에 연락하세요.
pt_br: Compra concluída, mas benefícios Pro não ativados. Tente novamente ou contate suporte.
zh_hant: 購買已完成，但未獲得 Pro 權益，請稍後重試或聯絡客服。

source: 购买未完成
en: Purchase Incomplete
es: Compra no completada
ja: 購入未完了
ko: 구매 미완료
pt_br: Compra incompleta
zh_hant: 購買未完成

source: 走一遍模拟对话
en: Practice a Simulated Conversation
es: Practicar un diálogo simulado
ja: 模擬対話を1回行う
ko: 모의 대화 1회
pt_br: Uma rodada de diálogo simulado
zh_hant: 走一遍模擬對話

source: 超出硅谷的英文世界
en: Beyond Silicon Valley
es: Más allá de Silicon Valley
ja: シリコンバレーを超えた英語の世界
ko: 실리콘밸리 밖 영어 세계
pt_br: Além do inglês do Vale do Silício
zh_hant: 超出矽谷的英文世界

source: 跟上对话
en: Keep Up With Dialogue
es: Seguir la charla
ja: 会話についていく
ko: 대화 따라잡기
pt_br: Acompanhar conversas
zh_hant: 跟上對話

source: 跟读三遍，把一个地道句型变成条件反射
en: Read Three Times to Make a Pattern Automatic
es: Lee tres veces, haz un patrón fluido
ja: 3回発音して自然な文型を条件反射に
ko: 세 번 읽어 자연스러운 문형이 자동으로 나와요.
pt_br: Repita três vezes e torne um padrão natural um reflexo
zh_hant: 跟讀三遍，把一個地道句型變成條件反射

source: 跟读练习
en: Repeat Exercise
es: Práctica de repetición
ja: シャドーイング練習
ko: 따라 말하기 연습
pt_br: Prática de leitura
zh_hant: 跟讀練習

source: 跳过
en: Skip
es: Saltar
ja: スキップ
ko: 건너뛰기
pt_br: Pular
zh_hant: 跳過

source: 返回我的句子
en: Back to My Sentences
es: Regresar a Mis frases
ja: 私の文に戻る
ko: 내 문장으로 돌아가기
pt_br: Voltar para Minhas frases

source: 返回词汇本
en: Return to Vocab Book
es: Regresar al vocabulario
ja: 単語リストに戻る
ko: 어휘장으로 돌아가기
pt_br: Voltar ao vocabulário
zh_hant: 返回單詞本

source: 还没有可以练习的句子
en: No Sentences to Practice
es: No hay frases para practicar
ja: 練習できる文がありません
ko: 연습할 문장이 없어요
pt_br: Nenhuma frase para praticar
zh_hant: 還沒有可以練習的句子

source: 还没有可以练习的词汇
en: No Words to Practice
es: No hay vocabulario para practicar
ja: 練習できる語彙がありません
ko: 연습 가능한 단어가 없습니다
pt_br: Sem palavras para praticar
zh_hant: 還沒有可以練習的單字

source: 还没有已掌握的句子，多练几轮连词成句
en: No Mastered Sentences Yet, Practice Sentence Builder More
es: No hay frases dominadas, practica ordenar la frase varias veces
ja: マスター済みの文がありません、並べ替えをもっと練習
ko: 아직 마스터한 문장이 없습니다. 문장 만들기를 더 연습하세요.
pt_br: Nenhuma frase dominada, pratique mais rodadas de Montar a frase
zh_hant: 還沒有已掌握的句子，多練幾輪連詞成句

source: 还没有收藏句子
en: No Favorite Sentences Yet
es: No hay frases guardadas
ja: お気に入り文がありません
ko: 아직 즐겨찾기에 문장이 없습니다.
pt_br: Nenhuma frase favorita
zh_hant: 還沒有收藏句子

source: 这个分类暂时没有句子
en: No Sentences in This Category
es: Este grupo no tiene frases
ja: このカテゴリーには文がありません
ko: 이 카테고리에 문장이 없습니다.
pt_br: Nenhuma frase nesta categoria
zh_hant: 這個分類暫時沒有句子

source: 这些词都已在单词本里
en: All Words Already in Vocabulary
es: Estas palabras ya están en el vocabulario
ja: これらの単語は既に単語リストにあります
ko: 모든 단어가 이미 단어장에 있음
pt_br: Estas palavras já estão no vocabulário
zh_hant: 這些單字都已在單詞本裡

source: 这将清除所有学习记录、词汇和设置。此操作不可撤销。
en: This will clear all study history, vocabulary, and settings. This action cannot be undone.
es: Esto borrará todos los registros de aprendizaje, palabras y configuraciones. No se puede deshacer.
ja: 学習記録、語彙、設定がすべて削除されます。この操作は取り消せません。
ko: 모든 학습 기록, 단어 및 설정이 삭제됩니다. 이 작업은 취소할 수 없습니다.
pt_br: Isso irá limpar registros, palavras e definições. Não pode ser desfeito.
zh_hant: 這將清除所有學習記錄、單字和設定。此操作不可撤銷。

source: 进阶听众
en: Intermediate Listener
es: Oyente avanzado
ja: 中級リスナー
ko: 중급 청취자
pt_br: Ouvinte intermediário
zh_hant: 進階聽眾

source: 连续
en: Streak
es: Racha
ja: 連続
ko: 연속
pt_br: Sequência
zh_hant: 連續

source: 连续 %lld 天
en: %lld-Day Streak
es: Racha de %lld días
ja: 連続%lld日
ko: 연속 %lld일
pt_br: Sequência de %lld dias
zh_hant: 連續 %lld 天

source: 连词成句
en: Sentence Builder
es: Ordenar la frase
ja: 並べ替え
ko: 문장 만들기
pt_br: Montar a frase
zh_hant: 連詞成句

source: 连词成句一轮
en: Sentence Builder Round
es: Una ronda de Ordenar la frase
ja: 並べ替え1ラウンド
ko: 문장 만들기 1회
pt_br: Uma rodada de montar a frase
zh_hant: 連詞成句一輪

source: 适应 5 遍精听的节奏，能从整句里抓到关键词，英语不再是一片模糊的背景音
en: Adapt to 5-Time Intensive Listening, Catch Keywords, No More Blur
es: Acostúmbrate al ritmo de escuchar 5 veces, captura palabras clave, inglés deja de ser solo ruido de fondo
ja: 5回精聴のリズムに慣れ、文からキーワードを掴む、英語はもう曖昧な背景音ではない
ko: 5회 반복 청취에 익숙해지면 문장 속 키워드 파악 가능, 영어가 더 이상 희미하지 않음
pt_br: Adapte-se ao ritmo de 5 vezes audição precisa, capture palavras-chave das frases, inglês não mais som de fundo vago
zh_hant: 適應 5 遍精聽的節奏，能從整句裡抓到關鍵詞，英語不再是一片模糊的背景音

source: 选择恰当的句子填空
en: Choose the Right Sentence to Fill in the Blanks
es: Elige la frase correcta para completar
ja: 適切な文を選んで空欄を埋める
ko: 적절한 문장 선택 후 빈칸 채우기
pt_br: Escolha a frase correta para completar
zh_hant: 選擇恰當的句子填空

source: 选择级别
en: Choose Level
es: Elegir nivel
ja: レベルを選択
ko: 레벨 선택
pt_br: Escolher nível
zh_hant: 選擇級別

source: 速度
en: Speed
es: Velocidad
ko: 속도
pt_br: Velocidade

source: 造句达人
en: Sentence Expert
es: Experto en frases
ja: 並べ替え達人
ko: 문장 고수
pt_br: Especialista em frases
zh_hant: 造句達人

source: 配对
en: Match
es: Emparejar
ja: マッチング
ko: 매칭
pt_br: Combinar
zh_hant: 配對

source: 配对高手
en: Matchmaster
es: Maestro del emparejamiento
ja: マッチング達人
ko: 매칭 고수
pt_br: Especialista em combinações
zh_hant: 配對高手

source: 重试
en: Retry
es: Reintentar
ja: 再試行
ko: 재시도
pt_br: Retry
zh_hant: 重試

source: 随时取消
en: Cancel Anytime
es: Cancela en cualquier momento
ja: いつでもキャンセル
ko: 언제든 취소 가능
pt_br: Cancelar a qualquer momento
zh_hant: 隨時取消

source: 随机播放
en: Shuffle Play
es: Reproducción aleatoria
ja: シャッフル
ko: 랜덤 재생
pt_br: Reprodução aleatória
zh_hant: 隨機播放

source: 随着每日播客更新，句型讲解会陆续积累
en: Pattern Explainers Accumulate Daily with Podcasts
es: Con los pódcasts diarios, se acumulan explicaciones del patrón
ja: 毎日のポッドキャスト更新に伴い、文型解説が徐々に蓄積されます
ko: 매일 팟캐스트로 문형 해설이 축적됩니다
pt_br: A explicação do padrão acumula com podcasts diários
zh_hant: 隨著每日 Podcast 更新，句型講解會陸續累積

source: 隐私政策
en: Privacy Policy
es: Política de privacidad
ja: プライバシーポリシー
ko: 개인정보 보호정책
pt_br: Política de privacidade
zh_hant: 隱私政策

source: 隐藏诊断
en: Hide Diagnosis
es: Ocultar diagnóstico
ja: 診断を隠す
ko: 진단 숨기기
pt_br: Ocultar diagnóstico
zh_hant: 隱藏診斷

source: 音频源处理中，请稍后再试
en: Processing Audio Source, Please Try Again Later
es: Procesando audio, por favor intenta más tarde
ja: 音声処理中です。しばらくお待ちください。
ko: 오디오 소스 처리 중, 잠시 후 다시 시도
pt_br: Processando áudio, tente novamente mais tarde
zh_hant: 音訊源处理中，請稍後再試

source: 首页
en: Home
es: Inicio
ja: ホーム
ko: 홈
pt_br: Início
zh_hant: 首頁

source: 高级
en: Advanced
es: Avanzado
ja: 上級
ko: 고급
pt_br: Avançado
zh_hant: 高級

source: 高级毕业
en: Advanced Graduate
es: Graduado avanzado
ja: 上級卒業
ko: 고급 졸업
pt_br: Conclusão nível avançado
zh_hant: 高級畢業

source: 高频句型开始形成条件反射，听到熟悉的场景，能直接反应出该说的那句话
en: Frequent Patterns Become Reflexive, Respond Instantly to Familiar Scenes
es: Patrones frecuentes crean reflejos, respondes automáticamente al escuchar escenarios familiares
ja: 頻出文型が条件反射になり、馴染みのシーンで直接反応
ko: 고빈도 문형이 조건반사로 익숙한 상황에서 바로 말할 수 있음
pt_br: Padrões frequentes se tornam reflexo, ao ouvir cenas conhecidas, reaja com a frase certa
zh_hant: 高頻句型開始形成條件反射，聽到熟悉的場景，能直接反應出該說的那句話

source: 高频句型讲解
en: Frequent Pattern Explainer
es: Explicación de patrones frecuentes
ja: 頻出文型解説
ko: 고빈도 문형 해설
pt_br: Explicação de padrões frequentes
zh_hant: 高頻句型講解

source: 🍽️ 餐厅
en: 🍽️ Restaurant
es: 🍽️ Restaurante
ja: 🍽️ レストラン
ko: 🍽️ 레스토랑
pt_br: 🍽️ Restaurante
zh_hant: 🍽️ 餐廳

source: 🏠 租房
en: 🏠 Rent
es: 🏠 Alquilar
ja: 🏠 部屋探し
ko: 🏠 주택 임대
pt_br: 🏠 Aluguel
zh_hant: 🏠 租屋

source: 🏦 银行
en: 🏦 Bank
es: 🏦 Banco
ja: 🏦 銀行
ko: 🏦 은행
pt_br: 🏦 Banco
zh_hant: 🏦 銀行
